app/views/users/show.html.erb

 <ul>
    <% @user.characters.each do |character| %>
---
SELECT "characters".* FROM "characters" WHERE "characters"."user_id" = 1