app/controllers/characters_controller.rb

  def index
    @characters = Character.all
---
SELECT "characters".* FROM "characters"

  def create
    @character = Character.new(character_params)

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("name", "image", "level", "backstory", "race", "path", "user_id", "created_at", "updated_at") VALUES ('Zorbzorbzorb', 'https://www.bubble-fun.fr/cdn/shop/products/zorb9.jpg?v=1565363211', 100, 'A zorb zorb', NULL, NULL, 1, '2025-02-21 08:29:31.684358', '2025-02-21 08:29:31.684358') RETURNING "id"

    def set_character
      @character = Character.find(params.expect(:id))
---
SELECT "characters".* FROM "characters" WHERE "characters"."id" = 1 LIMIT 1